## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| update | `module.rds_cluster.aws_rds_cluster.cluster`           |
| add    | `aws_rds_cluster_parameter_group.enable_audit_logging` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_rds_cluster_parameter_group.enable_audit_logging will be created
  + resource "aws_rds_cluster_parameter_group" "enable_audit_logging" {
      + arn         = (known after apply)
      + description = "RDS cluster parameter group with audit logging enabled"
      + family      = "aurora-mysql5.7"
      + id          = (known after apply)
      + name        = "wordpress-aurora-mysql57"
      + name_prefix = (known after apply)
      + tags_all    = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "server_audit_events"
          + value        = "CONNECT,QUERY_DCL,QUERY_DDL,QUERY_DML"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "server_audit_logging"
          + value        = "1"
        }
    }

  # module.rds_cluster.aws_rds_cluster.cluster will be updated in-place
  ~ resource "aws_rds_cluster" "cluster" {
      ~ db_cluster_parameter_group_name     = "default.aurora-mysql5.7" -> "wordpress-aurora-mysql57"
        id                                  = "wordpress-cluster"
        tags                                = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress-cluster"
            "Terraform"  = "true"
        }
        # (40 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.enable_audit_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_host"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_name"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_password"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_username"]

22 tests, 17 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
